#Ввод строки
my_string = input('Введите строку: ')
# Подсчет количества символов в строке
print('Количество символов в строке: ', len(my_string))
# Вывод введенной строки в верхнем регистре
print('Строка в верхнем регистре: ', my_string.upper())
# Вывод введенной строки в нижнем регистре
print('Строка в нижнем регистре: ', my_string.lower())
# Вывод строки без пробелов
print('Строка без пробелов: ', my_string.replace(" ", ""))
# Вывод первого символа строки
print('Первый символ строки: ', my_string[0])
# Вывод последнего символа строки
print('Последний символ строки: ', my_string[-1])
